Revit 2026 API

# TagOrientation Enumeration

---

An enumerated type listing tag orientation options that are supported by IndependentTags.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum TagOrientation
```
```vb
Public Enumeration TagOrientation
```
```cpp
public enum class TagOrientation
```
```fsharp
type TagOrientation
```

| Member name | Value | Description |
| --- | --- | --- |
| AnyModelDirection | 2 | The orientation of tag is Model. |
| Horizontal | 0 | The Orientation of tag is Horizontal. |
| Vertical | 1 | The Orientation of tag is Vertical. |

#### Reference

Autodesk.Revit.DB Namespace